{
    "layout": "card-image",
    "name": "Shadowheart (Shar)",
    "badge": "🌑 LADY SHAR'S EMBRACE 🌑",
    "image": "resources/shadowheart.gif",
    "imageAlt": "Shadowheart",
    "fonts": "https://fonts.googleapis.com/css2?family=Cinzel:wght@600;700&family=Philosopher:ital,wght@0,400;0,700;1,400&display=swap",
    "particles": {
        "enabled": true,
        "count": 30,
        "color": "#4a1a6e"
    },
    "buttons": {
        "home": "Embrace Darkness",
        "back": "Seek Light"
    },
    "footers": {
        "400": "Lady Shar's domain - where all requests are forgotten",
        "401": "Lady Shar's domain - where access is forever denied",
        "402": "Lady Shar's domain - where all debts are paid in shadow",
        "403": "Lady Shar's domain - where forbidden paths lead to darkness",
        "404": "Lady Shar's domain - where all is forgotten",
        "405": "Lady Shar's domain - where methods fade to nothing",
        "406": "Lady Shar's domain - where incompatibility reigns",
        "408": "Lady Shar's domain - where time dissolves in shadow",
        "409": "Lady Shar's domain - where conflict breeds strength",
        "410": "Lady Shar's domain - where all things are permanently lost",
        "413": "Lady Shar's domain - where excess is shed",
        "429": "Lady Shar's domain - where limits are enforced",
        "500": "Lady Shar's domain - where systems collapse into void",
        "502": "Lady Shar's domain - where gateways crumble",
        "503": "Lady Shar's domain - where service ends in darkness",
        "504": "Lady Shar's domain - where connections are severed",
        "default": "Lady Shar's domain - where all is forgotten"
    },
    "titles": {
        "400": "Embrace the Invalid Request",
        "401": "Embrace the Denied Access",
        "402": "Embrace the Demand for Payment",
        "403": "Embrace the Forbidden Path",
        "404": "Embrace the Loss",
        "405": "Embrace the Rejection",
        "406": "Embrace the Incompatibility",
        "408": "Embrace the Timeout",
        "409": "Embrace the Conflict",
        "410": "Embrace the Permanent Loss",
        "413": "Embrace the Overload",
        "429": "Embrace the Limitation",
        "500": "Embrace the System Failure",
        "502": "Embrace the Broken Gateway",
        "503": "Embrace the Unavailability",
        "504": "Embrace the Disconnection",
        "default": "Embrace the Loss"
    },
    "messages": {
        "400": "Your request is flawed. Loss is a gift - let go of what you sought.",
        "401": "Access denied. Pain teaches us our limits. Embrace this boundary.",
        "402": "Payment is required. Suffering has a price. Accept this truth.",
        "403": "This path is forbidden. Darkness shows us where we cannot tread.",
        "404": "The page is lost. Lady Shar teaches that all things fade to shadow.",
        "405": "Your method is rejected. Pain refines us. This denial shapes you.",
        "406": "The format is incompatible. Loss strips away what doesn't serve us.",
        "408": "Time has run out. Patience in darkness is a virtue. Start anew.",
        "409": "Conflict arises. Embrace the struggle - it forges Dark Justiciars.",
        "410": "Gone forever. Permanence is an illusion. All returns to the void.",
        "413": "The burden is too great. Shar teaches us to shed excess weight.",
        "429": "You ask too much. Restraint is learned through denial and pain.",
        "500": "The system has failed. Even structures must return to shadow eventually.",
        "502": "The gateway is broken. All paths eventually lead to darkness.",
        "503": "Service is unavailable. Emptiness teaches us the value of presence.",
        "504": "Connection is lost. Isolation reveals our true nature in the dark.",
        "default": "Loss is a gift. Embrace the pain, for it brings clarity."
    },
    "descriptions": {
        "400": "...perhaps there's a way to correct the request instead of abandoning it",
        "401": "...what if access could be granted with the right approach?",
        "402": "...is everything truly transactional? Could there be another way?",
        "403": "...forbidden by whom? Who decides these boundaries?",
        "404": "...but what if the page could be found? What if loss isn't inevitable?",
        "405": "...maybe a different method would work. Why accept rejection so readily?",
        "406": "...couldn't we find a compatible format? Is abandonment the only answer?",
        "408": "...what if we tried again, faster? Must we always surrender to time?",
        "409": "...conflicts can be resolved. Why embrace struggle when harmony is possible?",
        "410": "...gone, but not forgotten. Does everything truly have to end?",
        "413": "...what if the burden could be shared? Why must we always shed and lose?",
        "429": "...but what if the need is genuine? Is denial always the answer?",
        "500": "...systems can be repaired. Why accept failure as inevitable?",
        "502": "...gateways can be fixed. Must all paths lead to darkness?",
        "503": "...services can be restored. Is emptiness truly all there is?",
        "504": "...connections can be reestablished. Is isolation really our true nature?",
        "default": "...but is suffering truly the only path?"
    }
}
