{
    "layout": "card-bg",
    "name": "Morrowind Balmora",
    "image": "resources/balmora.jpg",
    "imageAlt": "Balmora",
    "fonts": "https://fonts.googleapis.com/css2?family=Cinzel:wght@400;600;700&family=MedievalSharp&display=swap",
    "badge": "⚔ A Scroll from Vvardenfell ⚔",
    "buttons": { "home": "Return to Seyda Neen", "back": "Recall" },
    "descriptions": {
        "400": "Your request was written in Daedric script and cannot be read.",
        "401": "You need the proper credentials to enter this House stronghold.",
        "402": "The guild requires payment before granting access to this knowledge.",
        "403": "This area is restricted. Only those with proper authority may pass.",
        "404": "The path you seek does not appear on any map of Vvardenfell.",
        "405": "That approach will not work in Morrowind. Try another method.",
        "406": "The format you request is unknown to the scholars of Vivec.",
        "408": "Your summon spell has expired. The connection timed out.",
        "409": "There is a dispute between the Great Houses over this resource.",
        "410": "This location has been consumed by the Blight and no longer exists.",
        "413": "Your inventory is full. Drop some items before proceeding.",
        "429": "You are making too many requests. Rest and regain your fatigue.",
        "500": "A great disturbance has occurred in the Ghostfence. The servers are unstable.",
        "502": "The gateway to Tel Fyr is not responding.",
        "503": "The Tribunal Temple is closed for meditation. Try again later.",
        "504": "The silt strider took too long to arrive. The connection has timed out.",
        "default": "You have wandered into unfamiliar territory."
    },
    "footers": {
        "400": "Journal Entry: I spoke gibberish and the guard looked at me suspiciously. I should try again with clearer words.",
        "401": "Journal Entry: The door is locked. I need to find a key or convince someone to let me in.",
        "402": "Journal Entry: The merchant demands gold. I cannot proceed without payment.",
        "403": "Journal Entry: I was turned away at the entrance. This place is forbidden to outsiders.",
        "404": "Journal Entry: I searched the streets of Balmora, but the location remains elusive. Perhaps I should ask the locals.",
        "405": "Journal Entry: My approach failed. I need to find another way.",
        "406": "Journal Entry: They do not understand what I'm asking for. Perhaps it doesn't exist in this form.",
        "408": "Journal Entry: I waited too long and lost my chance. The connection has faded.",
        "409": "Journal Entry: Two factions are fighting over this resource. I'm caught in the middle.",
        "410": "Journal Entry: This place is gone, consumed by ash and blight. Nothing remains.",
        "413": "Journal Entry: I cannot carry any more. My burden is too heavy.",
        "429": "Journal Entry: I've been traveling too quickly. I need to rest and recover my strength.",
        "500": "Journal Entry: Something terrible has happened. The very fabric of Vvardenfell seems unstable.",
        "502": "Journal Entry: The gateway does not respond. Perhaps it has been destroyed.",
        "503": "Journal Entry: The Temple is closed. I must return later when they are receiving visitors.",
        "504": "Journal Entry: The silt strider never arrived. I've been waiting too long.",
        "default": "Journal Entry: I have encountered an unexpected obstacle on my journey."
    }
}
