{
    "layout": "card-image",
    "name": "Zelda Master Sword (Elegant)",
    "image": "resources/sword.gif",
    "imageAlt": "Master Sword",
    "fonts": "https://fonts.googleapis.com/css2?family=Cinzel+Decorative:wght@400;700;900&family=Philosopher:wght@400;700&display=swap",
    "buttons": {
        "home": "Continue Quest",
        "back": "Retreat"
    },
    "titles": {
        "400": "Trial of Wisdom",
        "401": "Sealed Gate",
        "402": "Treasure Required",
        "403": "Sacred Seal",
        "404": "Trial of Courage",
        "405": "Wrong Path",
        "406": "Incompatible Magic",
        "408": "Time Expired",
        "409": "Conflicting Forces",
        "410": "Lost to Time",
        "413": "Burden Too Great",
        "429": "Exhausted Spirit",
        "500": "Dark Curse",
        "502": "Bridge Destroyed",
        "503": "Temple Sealed",
        "504": "Portal Collapsed",
        "default": "Trial of Courage"
    },
    "messages": {
        "400": "Bad Request",
        "401": "Unauthorized",
        "402": "Payment Required",
        "403": "Forbidden",
        "404": "Not Found",
        "405": "Method Not Allowed",
        "406": "Not Acceptable",
        "408": "Request Timeout",
        "409": "Conflict",
        "410": "Gone",
        "413": "Payload Too Large",
        "429": "Too Many Requests",
        "500": "Internal Server Error",
        "502": "Bad Gateway",
        "503": "Service Unavailable",
        "504": "Gateway Timeout",
        "default": "Unknown Error"
    },
    "descriptions": {
        "400": "Your request lacks the wisdom needed to proceed. Study the ancient texts, correct your approach, and return when you are ready, brave hero.",
        "401": "This gate is sealed and requires the proper credentials to pass. Prove your identity to the guardians and they shall grant you passage.",
        "402": "The treasure you seek requires payment. Gather the necessary rupees from your adventures and return to claim what lies beyond.",
        "403": "A sacred seal blocks your path. This area is forbidden to all but those chosen by the goddesses. Seek another way forward.",
        "404": "A true hero faces many obstacles on their journey. This page may be lost, but your courage remains unshaken. Rise, hero, and continue your quest.",
        "405": "The method you have chosen will not open this path. A hero must be wise and flexible. Try a different approach to overcome this trial.",
        "406": "The magic you wield is incompatible with this realm. Even the Master Sword cannot cut through all barriers. Seek different tools, hero.",
        "408": "Time has run out on your quest. A hero must act swiftly when the moment calls. Gather your strength and try again with haste.",
        "409": "Conflicting forces battle within this space. As a hero, you must restore balance. Refresh your resolve and try again.",
        "410": "What you seek has been lost to the sands of time. Even the Hero of Legend cannot reclaim what the goddesses have taken. Accept this and move forward.",
        "413": "Your burden is too great to carry forward. A true hero knows when to lighten their load. Leave behind what you do not need and try again.",
        "429": "Your spirit is exhausted from too many attempts. A hero must know when to rest. Regain your strength before continuing your quest.",
        "500": "A dark curse has befallen the server. The sages are working to lift it. Until then, hero, you must be patient and trust in their wisdom.",
        "502": "The bridge between realms has been destroyed. The ancient builders are working to restore the passage. Return soon, brave one.",
        "503": "The temple has been sealed for sacred rituals. When the ceremony is complete, the doors shall open once more. Wait with patience, hero.",
        "504": "The portal collapsed before the connection could be made. Even magic has its limits. Give the wizards time to restore the gateway.",
        "default": "A true hero faces many obstacles on their journey. This page may be lost, but your courage remains unshaken. Rise, hero, and continue your quest."
    },
    "footers": {
        "400": "Even heroes must learn from their mistakes",
        "401": "A hero's identity opens many doors",
        "402": "Rupees are the key to many treasures",
        "403": "Not all paths are meant to be taken",
        "404": "Courage need not be remembered, for it is never forgotten",
        "405": "A flexible hero survives any trial",
        "406": "The right tool makes all the difference",
        "408": "Swift action defines a true hero",
        "409": "Balance brings peace to the realm",
        "410": "What is lost may find new purpose",
        "413": "A light step carries you further",
        "429": "Even legends need to rest",
        "500": "Darkness always gives way to light",
        "502": "Builders work while heroes wait",
        "503": "Sacred moments require patience",
        "504": "All magic has its time to restore",
        "default": "Courage need not be remembered, for it is never forgotten"
    }
}
