{
    "layout": "card-image",
    "name": "Jedi Mind Trick",
    "badge": "✋ JEDI MIND TRICK ✋",
    "image": "resources/jedi.gif",
    "imageAlt": "Jedi mind trick",
    "fonts": "https://fonts.googleapis.com/css2?family=Orbitron:wght@700;900&family=Roboto:wght@400;700&display=swap",
    "particles": {
        "enabled": true,
        "count": 100,
        "color": "#ffffff",
        "type": "stars"
    },
    "buttons": {
        "home": "Use the Force",
        "back": "Move Along"
    },
    "titles": {
        "400": "This is not the request\nyou are looking for",
        "401": "These are not the credentials\nyou are looking for",
        "402": "This is not the payment\nyou are looking for",
        "403": "This is not the permission\nyou are looking for",
        "404": "This is not the URL\nyou are looking for",
        "405": "This is not the method\nyou are looking for",
        "406": "This is not the format\nyou are looking for",
        "408": "This is not the timeout\nyou are looking for",
        "409": "This is not the conflict\nyou are looking for",
        "410": "These are not the pages\nyou are looking for",
        "413": "This is not the file size\nyou are looking for",
        "429": "These are not the requests\nyou are looking for",
        "500": "This is not the server\nyou are looking for",
        "502": "This is not the gateway\nyou are looking for",
        "503": "This is not the service\nyou are looking for",
        "504": "This is not the connection\nyou are looking for",
        "default": "This is not the URL\nyou are looking for"
    },
    "messages": {
        "400": "*waves hand* Your request was malformed. These aren't the parameters the server is looking for.",
        "401": "*waves hand* You don't have authorization. These aren't the credentials you need.",
        "402": "*waves hand* Payment is required to access this. These aren't the free resources you're looking for.",
        "403": "*waves hand* Access is forbidden. You don't need to see this restricted area.",
        "404": "*waves hand* You don't need to see this page. The URL you seek does not exist here.",
        "405": "*waves hand* That HTTP method won't work here. These aren't the verbs you're looking for.",
        "406": "*waves hand* The format you requested isn't available. This isn't the content type you're looking for.",
        "408": "*waves hand* The request took too long. This isn't the timely response you're looking for.",
        "409": "*waves hand* There's a conflict in the data. This isn't the synchronized state you're looking for.",
        "410": "*waves hand* This content is gone forever. These aren't the pages that exist anymore.",
        "413": "*waves hand* Your upload is too large. This isn't the file size the server accepts.",
        "429": "*waves hand* You're making too many requests. This isn't the rate limit you wanted.",
        "500": "*waves hand* The server encountered an error. This isn't the working server you're looking for.",
        "502": "*waves hand* The gateway failed. This isn't the connection path you're looking for.",
        "503": "*waves hand* The service is unavailable. This isn't the online server you're looking for.",
        "504": "*waves hand* The gateway timed out. This isn't the fast connection you're looking for.",
        "default": "*waves hand* You don't need to see this page."
    },
    "descriptions": {
        "400": "You can fix your request syntax. Move along.",
        "401": "You can go get proper credentials. Move along.",
        "402": "You can find the payment portal. Move along.",
        "403": "You can request access from an admin. Move along.",
        "404": "You can go about your business. Move along.",
        "405": "You can try a different HTTP method. Move along.",
        "406": "You can adjust your Accept headers. Move along.",
        "408": "You can retry with a faster connection. Move along.",
        "409": "You can resolve the conflict and retry. Move along.",
        "410": "You can search for alternate content. Move along.",
        "413": "You can reduce your file size. Move along.",
        "429": "You can slow down your requests. Move along.",
        "500": "You can wait for the server to recover. Move along.",
        "502": "You can try a different gateway route. Move along.",
        "503": "You can come back when service resumes. Move along.",
        "504": "You can retry when the gateway responds. Move along.",
        "default": "You can go about your business. Move along."
    },
    "footers": {
        "400": "These aren't the valid requests you're looking for...",
        "401": "These aren't the authorized users you're looking for...",
        "402": "These aren't the free services you're looking for...",
        "403": "These aren't the accessible pages you're looking for...",
        "404": "These aren't the URLs you're looking for...",
        "405": "These aren't the allowed methods you're looking for...",
        "406": "These aren't the acceptable formats you're looking for...",
        "408": "These aren't the timely responses you're looking for...",
        "409": "These aren't the conflict-free operations you're looking for...",
        "410": "These aren't the existing pages you're looking for...",
        "413": "These aren't the acceptable file sizes you're looking for...",
        "429": "These aren't the unlimited requests you're looking for...",
        "500": "These aren't the working servers you're looking for...",
        "502": "These aren't the functioning gateways you're looking for...",
        "503": "These aren't the available services you're looking for...",
        "504": "These aren't the responsive gateways you're looking for...",
        "default": "These aren't the errors you're looking for..."
    }
}
