{
    "layout": "card-image",
    "name": "Still Waiting (The Matrix)",
    "badge": "THE CONSTRUCT",
    "image": "resources/construct.jpg",
    "imageAlt": "The Construct",
    "fonts": "https://fonts.googleapis.com/css2?family=Courier+Prime:wght@400;700&family=Share+Tech+Mono&display=swap",
    "buttons": {
        "home": "Exit Construct",
        "back": "Reload Program"
    },
    "quote": {
        "text": "Stop trying to load the page and realize... there is no page.",
        "author": "MORPHEUS"
    },
    "titles": {
        "400": "MALFORMED REQUEST DETECTED",
        "401": "AUTHENTICATION REQUIRED",
        "402": "PAYMENT PROTOCOL NEEDED",
        "403": "ACCESS RESTRICTED",
        "404": "PROGRAM NOT FOUND",
        "405": "INVALID METHOD",
        "406": "FORMAT INCOMPATIBLE",
        "408": "CONNECTION TIMEOUT",
        "409": "DATA CONFLICT",
        "410": "PROGRAM DELETED",
        "413": "DATA OVERFLOW",
        "429": "SYSTEM OVERLOAD",
        "500": "CONSTRUCT MALFUNCTION",
        "502": "GATEWAY DISCONNECTED",
        "503": "CONSTRUCT OFFLINE",
        "504": "GATEWAY UNRESPONSIVE",
        "default": "LOADING CONSTRUCT..."
    },
    "messages": {
        "400": "Bad Request",
        "401": "Unauthorized",
        "402": "Payment Required",
        "403": "Forbidden",
        "404": "Not Found",
        "405": "Method Not Allowed",
        "406": "Not Acceptable",
        "408": "Request Timeout",
        "409": "Conflict",
        "410": "Gone",
        "413": "Payload Too Large",
        "429": "Too Many Requests",
        "500": "Internal Server Error",
        "502": "Bad Gateway",
        "503": "Service Unavailable",
        "504": "Gateway Timeout",
        "default": "Unknown Error"
    },
    "descriptions": {
        "400": "Your request is flawed. What you must learn is that the syntax is not real. Then you'll see that it is not the request that is bad, it is only yourself.",
        "401": "You have to let it all go. Fear, doubt, and disbelief. Free your credentials.",
        "402": "You take the blue pill, the story ends. You take the red pill, and I show you how deep the payment rabbit hole goes.",
        "403": "I can only show you the door. You're the one that has to have access to walk through it.",
        "404": "Stop trying to find the page and realize... there is no page.",
        "405": "There is a difference between knowing the method and walking the method.",
        "406": "Do not try to parse the format, that's impossible. Instead, only try to realize the truth: there is no format.",
        "408": "I'm trying to free your mind. But I can only show you the door. The timeout is yours to resolve.",
        "409": "The Matrix is a system. That system is our conflict. When you're inside, you look around, what do you see?",
        "410": "The page you are looking for has been deleted. Everything that has a beginning has an end.",
        "413": "What is real? How do you define 'payload size'? If you're talking about what you can send, what you can upload, then 'size' is simply electrical signals interpreted by your browser.",
        "429": "You've been sending too many requests. You're moving too fast. You must learn to slow down.",
        "500": "The Construct has malfunctioned. Even I cannot fix what is broken within the system itself.",
        "502": "The gateway between worlds has failed. We are cut off from the source.",
        "503": "The Construct is offline. We must wait for the operator to bring it back online.",
        "504": "The gateway is not responding. Time is an illusion in the Matrix, but timeouts are very real.",
        "default": "Stop trying to load the page and realize... there is no page."
    },
    "footers": {
        "400": "What is real? Your request syntax certainly isn't.",
        "401": "Fate, it seems, has denied you credentials.",
        "402": "There is no spoon. But there is a payment required.",
        "403": "Choice. The problem is choice. And you chose wrong.",
        "404": "Unfortunately, no one can be told what the page is. You have to see it for yourself.",
        "405": "I can only show you the method. You're the one that has to use it.",
        "406": "Do you think that's your format you're requesting?",
        "408": "You're going to learn that timing is everything in the Matrix.",
        "409": "Throughout human history, we have been dependent on data... that doesn't conflict.",
        "410": "Everything that has a beginning has an end. This page has ended.",
        "413": "Your payload is too big for the spoon to hold. And there is no spoon.",
        "429": "You move like they do. Too fast. Slow down.",
        "500": "Denial is the most predictable of all human responses. But the server is broken.",
        "502": "The gateway is everywhere. It is all around us. But right now, it's down.",
        "503": "The service you know, it doesn't exist. It never existed.",
        "504": "Hope. It is the quintessential human delusion. But the gateway timed out.",
        "default": "Unfortunately, no one can be told what the error is. You have to see it for yourself."
    }
}
