{
    "layout": "card-bg",
    "name": "Middle-earth Map",
    "image": "resources/middle-earth-map.jpg",
    "imageAlt": "Middle-earth Map",
    "fonts": "https://fonts.googleapis.com/css2?family=Cinzel:wght@400;600;700&family=Uncial+Antiqua&display=swap",
    "badge": "The Maps of Middle-earth",
    "buttons": { "home": "Return to the Shire", "back": "Retrace Your Steps" },
    "descriptions": {
        "400": "Your request was written in the Black Speech and cannot be understood.",
        "401": "You need the key to the Mines of Moria to access this realm.",
        "402": "The toll to cross this bridge has not been paid.",
        "403": "You shall not pass! This path is forbidden to all who seek it.",
        "404": "The path you seek is not marked upon these ancient maps.",
        "405": "That method will not work in Middle-earth. Try a different path.",
        "406": "The format you request cannot be found in any of the archives of Gondor.",
        "408": "The beacons were not lit in time. Your request has timed out.",
        "409": "There is a conflict between the kingdoms. This resource is contested.",
        "410": "This realm has been abandoned and its halls are empty.",
        "413": "Your burden is too great, even for one who has borne the Ring.",
        "429": "You have traveled too swiftly. Even the eagles need rest.",
        "500": "A great disturbance has occurred in Middle-earth. The servers of Isengard have fallen.",
        "502": "The gateway at the Black Gate is not responding.",
        "503": "The realm is temporarily closed. The King is in counsel.",
        "504": "The gateway took too long to respond. Perhaps the roads are watched.",
        "default": "An unexpected journey has led you astray."
    },
    "footers": {
        "400": "\"A wizard should know better than to speak in riddles.\"",
        "401": "\"The way is shut. It was made by those who are dead.\"",
        "402": "\"We cannot get out. Drums in the deep.\"",
        "403": "\"You shall not pass!\" - Gandalf the Grey",
        "404": "\"Not all those who wander are lost, but this page certainly is.\"",
        "405": "\"One does not simply walk into this resource.\"",
        "406": "\"I asked for one thing, and they gave me another.\"",
        "408": "\"Time is running short. The quest has failed.\"",
        "409": "\"There is but one Lord of the Ring, and he does not share power.\"",
        "410": "\"The age of Men is over. The age of this page has ended.\"",
        "413": "\"The load is too heavy. Cast it into the fire!\"",
        "429": "\"Fool of a Took! Stop making so many requests!\"",
        "500": "\"Something terrible has happened in the depths.\"",
        "502": "\"The beacons are lit, but there is no answer.\"",
        "503": "\"The steward of Gondor has asked that you wait.\"",
        "504": "\"No news from the watchers. The gateway is silent.\"",
        "default": "\"The road goes ever on and on...\""
    }
}
