{
    "layout": "card-image",
    "name": "Rick and Morty",
    "badge": "🧪 INTERDIMENSIONAL ERROR 🧪",
    "image": "resources/rickmorty.png",
    "imageAlt": "Rick and Morty",
    "fonts": "https://fonts.googleapis.com/css2?family=Permanent+Marker&family=Roboto:wght@400;700&display=swap",
    "particles": {
        "enabled": true,
        "count": 40,
        "color": "#00ff00"
    },
    "buttons": {
        "home": "Portal Home",
        "back": "Aw Geez, Go Back"
    },
    "titles": {
        "400": "BAD REQUEST, MORTY!",
        "401": "UNAUTHORIZED!",
        "402": "PAYMENT REQUIRED!",
        "403": "FORBIDDEN, MORTY!",
        "404": "PAGE NOT FOUND!",
        "405": "METHOD NOT ALLOWED!",
        "406": "NOT ACCEPTABLE!",
        "408": "REQUEST TIMEOUT!",
        "409": "CONFLICT, MORTY!",
        "410": "GONE FOREVER!",
        "413": "TOO BIG, MORTY!",
        "429": "TOO MANY REQUESTS!",
        "500": "SERVER ERROR!",
        "502": "BAD GATEWAY!",
        "503": "SERVICE DOWN!",
        "504": "GATEWAY TIMEOUT!",
        "default": "WUBBA LUBBA DUB DUB!"
    },
    "messages": {
        "400": "*burp* Oh great, Morty! The humans sent a BAD REQUEST. You know what that means? Their primitive input validation is so terrible they literally ACCEPT garbage data and THEN complain about it!",
        "401": "Unauthorized? UN-AUTHORIZED?! *burp* Morty, these idiots put a LOCK on their website and then act SURPRISED when people can't get in without a key!",
        "402": "*burp* They want PAYMENT, Morty! Can you believe that? These primitive apes still use CURRENCY!",
        "403": "FORBIDDEN! *burp* Oh, that's rich! These humans create CONTENT and then FORBID people from seeing it!",
        "404": "*burp* Classic human error, Morty! The page is NOT FOUND! You know why? Because their pathetic FILING SYSTEMS are based on HIERARCHY instead of quantum-entangled neural networks!",
        "405": "Method not ALLOWED?! *burp* Morty, they built a DOOR and then got MAD when you tried to OPEN it!",
        "406": "*burp* Not ACCEPTABLE?! The FORMAT isn't ACCEPTABLE?! Morty, in dimension C-500A, there ARE no formats! Data is just DATA!",
        "408": "Request TIMEOUT! *burp* You know what this means, Morty? Their servers are so SLOW that they give UP!",
        "409": "CONFLICT! *burp* Oh, there's a CONFLICT in their data! You know what I do when there's a conflict, Morty? I go to another DIMENSION where there ISN'T one!",
        "410": "It's GONE, Morty! *burp* PERMANENTLY GONE! You know what's funny? Nothing is EVER gone! It exists in SOME dimension, Morty!",
        "413": "Payload too LARGE?! *burp* TOO LARGE?! Morty, I once transported an ENTIRE PLANET through a microscopic portal!",
        "429": "*burp* Too many requests! TOO MANY REQUESTS! You know what that means, Morty? Their servers are so pathetic they can't handle NORMAL USAGE!",
        "500": "INTERNAL SERVER ERROR! *burp* INTERNAL! You know what that means, Morty? THEY don't even know what went wrong!",
        "502": "*burp* Bad GATEWAY! The gateway is BAD! You know what I use for gateways, Morty? INTERDIMENSIONAL PORTALS that NEVER fail!",
        "503": "Service UNAVAILABLE! *burp* UNAVAILABLE! Translation: their server GAVE UP!",
        "504": "Gateway TIMEOUT! *burp* It took too long so they just QUIT!",
        "default": "*burp* Can you believe this, Morty? These humans STILL have errors. They literally designed errors into their machines as a FEATURE!"
    },
    "descriptions": {
        "400": "Oh geez, R-Rick, I think they just, you know, sent the wrong data format or something? Like, m-maybe they forgot a parameter?",
        "401": "Aw geez, Rick, th-they don't have the right password or credentials or whatever? M-maybe they just need to, like, log in first?",
        "402": "Uh, Rick, I-I think this is like a premium feature or something? Like, they gotta pay for it?",
        "403": "Rick, I-I-I think they're not allowed to see this page? Like, m-maybe they need admin permissions or something?",
        "404": "Aw geez, Rick, the-the page just isn't there anymore? Like, m-m-maybe it got deleted or moved or something?",
        "405": "Oh man, Rick, I think they used like POST when they should've used GET or something? I-I-I don't really understand HTTP methods.",
        "406": "Geez, Rick, I think their browser is asking for like JSON but the server only has HTML or something?",
        "408": "Aw geez, Rick, th-the connection was just too slow? Like, maybe their internet is bad? Or the server is far away?",
        "409": "Oh man, Rick, there's like two versions of the same thing and they're fighting? Like, m-maybe someone else edited it at the same time?",
        "410": "Rick, I-I think the page is like, permanently deleted? Like it's never coming back?",
        "413": "Geez, Rick, their file is just too big to upload? Like, m-maybe they should compress it or split it up or something?",
        "429": "Aw geez, Rick, they're making too many requests too fast? Like, maybe they should slow down a bit?",
        "500": "Oh no, Rick, something broke on the server side? Like, the-the programmers messed up somewhere?",
        "502": "Geez Rick, the-the gateway server can't talk to the backend server? Like, maybe one of them is down?",
        "503": "Aw man, Rick, the server is like, overloaded or under maintenance or something? M-maybe they should try again later?",
        "504": "Oh geez, Rick, the gateway waited too long for a response and gave up? Like, maybe the backend server is really slow?",
        "default": "Aw geez, Rick, I-I-I think the, uh, the server just couldn't find the page? M-maybe we should just, you know, go back?"
    },
    "footers": {
        "400": "Dimension C-137 - Where requests are properly formatted",
        "401": "Dimension C-137 - Where everyone has credentials",
        "402": "Dimension C-137 - Where currency is obsolete",
        "403": "Dimension C-137 - Where nothing is forbidden",
        "404": "Dimension C-137 - Where everything can be found",
        "405": "Dimension C-137 - Where all methods work",
        "406": "Dimension C-137 - Where formats don't matter",
        "408": "Dimension C-137 - Where time is infinite",
        "409": "Dimension C-137 - Where conflicts don't exist",
        "410": "Dimension C-137 - Where nothing is truly gone",
        "413": "Dimension C-137 - Where size is irrelevant",
        "429": "Dimension C-137 - Where rate limits are unnecessary",
        "500": "Dimension C-137 - Where servers never fail",
        "502": "Dimension C-137 - Where gateways are perfect",
        "503": "Dimension C-137 - Where services never go down",
        "504": "Dimension C-137 - Where timeouts don't happen",
        "default": "Dimension C-137 Error System"
    }
}
