{
    "layout": "card-bg",
    "name": "Lotus Petal",
    "image": "resources/mountain.jpg",
    "imageAlt": "Mountain",
    "fonts": "https://fonts.googleapis.com/css2?family=Noto+Serif:wght@300;400;600&family=Inter:wght@300;400;500&display=swap",
    "particles": { "enabled": true, "count": 25, "color": "rgba(255, 255, 255, 0.8)" },
    "buttons": { "home": "Return Home", "back": "Go Back" },
    "messages": {
        "400": "Request Unclear",
        "401": "Authentication Needed",
        "402": "Payment Required",
        "403": "Access Denied",
        "404": "Path Not Found",
        "405": "Method Not Allowed",
        "406": "Format Mismatch",
        "408": "Time Passed",
        "409": "Conflict Arose",
        "410": "Resource Departed",
        "413": "Too Much Data",
        "429": "Too Many Requests",
        "500": "Server Meditation",
        "502": "Gateway Issue",
        "503": "Service Resting",
        "504": "Gateway Timeout",
        "default": "Something Happened"
    },
    "descriptions": {
        "400": "Your request arrived unclear, like mist in the morning. Perhaps revisit what you're seeking and try once more with clarity.",
        "401": "This path requires authentication, like a garden gate awaiting its key. Please sign in to continue your journey.",
        "402": "This content rests behind a payment gateway. Consider what value it brings before proceeding.",
        "403": "This space is protected, like sacred ground. You may not enter here, but other paths await you.",
        "404": "Like a lotus petal on still water, sometimes we drift to places we didn't intend. Let's find your way back to where you meant to be.",
        "405": "This method is not the way forward here. Like choosing the right tool for meditation, try a different approach.",
        "406": "The format you seek is not available in this moment. Perhaps another form would serve you better.",
        "408": "Time flowed by while waiting for the request. The moment has passed—let's begin again.",
        "409": "A conflict has emerged in the data, like two stones disturbing still water. Refresh and find balance once more.",
        "410": "What you seek has departed permanently, released like a breath into the wind. It is time to let go and move forward.",
        "413": "The data you sent is too vast for this path. Consider sending smaller, more mindful portions.",
        "429": "You're moving too quickly, like rushing water over stones. Pause, breathe, and try again in a moment.",
        "500": "The server is taking a moment to meditate on what went wrong. We'll restore balance shortly.",
        "502": "The connection between gateways is misaligned. Give it a moment to find harmony again.",
        "503": "The service is resting and gathering energy. It will return when ready.",
        "504": "The gateway took too long to respond, like waiting for an echo that never came. Let's try once more.",
        "default": "An error occurred. Please breathe and try again."
    },
    "footers": {
        "400": "Clarity comes with patience",
        "401": "Every gate has its key",
        "402": "Value is subjective",
        "403": "Respect the boundaries",
        "404": "Peace is a journey, not a destination",
        "405": "Flexibility is wisdom",
        "406": "Adaptation is strength",
        "408": "Time waits for no one",
        "409": "Balance restores itself",
        "410": "Letting go is freedom",
        "413": "Less is often more",
        "429": "Haste makes waste",
        "500": "Even servers need rest",
        "502": "All connections require alignment",
        "503": "Rest is productive",
        "504": "Patience through delays",
        "default": "Find peace in the moment"
    }
}
