{
    "layout": "card-image",
    "name": "Psycho-Pass",
    "badge": "⚠ SIBYL SYSTEM ⚠",
    "image": "resources/dominator.jpg",
    "imageAlt": "Dominator",
    "fonts": "https://fonts.googleapis.com/css2?family=Orbitron:wght@400;700;900&family=Rajdhani:wght@400;600;700&display=swap",
    "buttons": {
        "home": "Return to System",
        "back": "Re-scan"
    },
    "titles": {
        "400": "INVALID REQUEST DETECTED",
        "401": "AUTHENTICATION REQUIRED",
        "402": "PAYMENT VERIFICATION FAILED",
        "403": "ACCESS DENIED",
        "404": "TARGET NOT FOUND",
        "405": "METHOD PROHIBITED",
        "406": "FORMAT UNACCEPTABLE",
        "408": "REQUEST TIMEOUT",
        "409": "DATA CONFLICT DETECTED",
        "410": "TARGET ELIMINATED",
        "413": "PAYLOAD EXCEEDS LIMITS",
        "429": "EXCESSIVE REQUESTS DETECTED",
        "500": "SYSTEM MALFUNCTION",
        "502": "GATEWAY FAILURE",
        "503": "SERVICE OFFLINE",
        "504": "GATEWAY TIMEOUT",
        "default": "TARGET NOT FOUND"
    },
    "messages": {
        "400": "Non-Lethal Paralyzer mode. Stun the malformed request and reconstruct.",
        "401": "Paralyzer mode. Suppress unauthorized access attempt.",
        "402": "Non-Lethal Paralyzer mode. Suspend transaction until verification.",
        "403": "Lethal Eliminator mode authorized. Threat level exceeds 300.",
        "404": "Paralyzer mode. Search and relocate missing target.",
        "405": "Non-Lethal Paralyzer mode. Redirect method approach.",
        "406": "Paralyzer mode. Force format compliance.",
        "408": "Non-Lethal Paralyzer mode. Reset timeout parameters.",
        "409": "Paralyzer mode. Isolate and resolve conflict.",
        "410": "Destroy Decomposer mode. Target has been permanently eliminated.",
        "413": "Paralyzer mode. Compress and reduce payload.",
        "429": "Lethal Eliminator mode standby. Reduce request frequency immediately.",
        "500": "System diagnostic mode. Sibyl System requires immediate attention.",
        "502": "Lethal Eliminator mode standby. Gateway threat assessment in progress.",
        "503": "Standby mode. Await system restoration.",
        "504": "Paralyzer mode. Force gateway reconnection.",
        "default": "Dominator set to Paralyzer mode. Aim carefully and suppress the target."
    },
    "descriptions": {
        "400": "The request format has been deemed incompatible with system protocols. The syntax structure violates established communication standards. Enforcement action: Request reconstruction required.",
        "401": "Authentication credentials have not been provided or are invalid. The target's identity cannot be verified through Sibyl System protocols. Enforcement action: Credential verification required.",
        "402": "Payment verification has failed. Economic transaction protocols have not been satisfied. The target must complete financial authorization before proceeding. Enforcement action: Transaction completion required.",
        "403": "Access to the requested resource has been denied. The target's clearance level is insufficient. Crime coefficient indicates unauthorized access attempt. Enforcement action: Access restriction maintained.",
        "404": "The requested target has not been found in any sector. Scan results indicate the resource may have been relocated or eliminated. Area enforcement protocols activated. Enforcement action: Target relocation required.",
        "405": "The requested method has been prohibited by system protocols. The approach violates established communication standards. Enforcement action: Method revision required.",
        "406": "The requested format is not acceptable. Content negotiation has failed. The target's request cannot be fulfilled in the specified format. Enforcement action: Format adjustment required.",
        "408": "Request processing has exceeded time limits. The target failed to complete the transaction within allocated timeframe. Enforcement action: Retry with increased priority.",
        "409": "Data conflict has been detected. The request conflicts with current system state. Multiple enforcement actions are attempting simultaneous modifications. Enforcement action: Conflict resolution required.",
        "410": "The target has been permanently eliminated from the system. No backup data exists in any sector. The resource has been decomposed beyond recovery. Enforcement action: Accept termination.",
        "413": "Payload size exceeds system capacity limits. The data transfer violates established protocols. Enforcement action: Payload reduction required.",
        "429": "Excessive request frequency detected. The target is generating requests at a rate that threatens system stability. Crime coefficient rising. Enforcement action: Request throttling activated.",
        "500": "Critical system malfunction detected. Sibyl System has encountered an internal error. Enforcement protocols compromised. Enforcement action: System restoration in progress.",
        "502": "Gateway connection has failed. Communication with upstream systems has been severed. Enforcement action: Gateway re-establishment required.",
        "503": "Service is currently offline for maintenance. System resources are unavailable. Enforcement action: Standby mode until restoration.",
        "504": "Gateway response timeout. The upstream system failed to respond within acceptable parameters. Enforcement action: Connection retry required.",
        "default": "The target's psycho-pass has been analyzed. Enforcement action required."
    },
    "footers": {
        "400": "Crime doesn't sleep, and neither does bad syntax.",
        "401": "Your psycho-pass has been clouded by lack of credentials.",
        "402": "Even in the future, nothing is free.",
        "403": "The Sibyl System has deemed you unworthy of access.",
        "404": "Not all targets can be found in this dystopia.",
        "405": "Wrong method, wrong approach. The Sibyl System judges all.",
        "406": "The system only accepts perfect compliance.",
        "408": "Time waits for no one, not even the Sibyl System.",
        "409": "In a world of order, conflict must be eliminated.",
        "410": "Some things, once gone, can never return.",
        "413": "Even data has its limits in this controlled society.",
        "429": "Calm down. Excessive behavior clouds your psycho-pass.",
        "500": "Even the Sibyl System is not infallible.",
        "502": "The gateway between worlds has collapsed.",
        "503": "The system rests, but enforcement never sleeps.",
        "504": "Connection lost in the labyrinth of the network.",
        "default": "The law doesn't protect people. People protect the law."
    }
}
