{
    "layout": "card-bg",
    "name": "Ready Player One",
    "badge": "OASIS System Alert",
    "image": "resources/OASIS.jpg",
    "imageAlt": "The OASIS",
    "fonts": "https://fonts.googleapis.com/css2?family=Orbitron:wght@700;900&family=Rajdhani:wght@600;700&display=swap",
    "buttons": {
        "home": "Back to the OASIS",
        "back": "Previous Location"
    },
    "titles": {
        "400": "Corrupted Input Detected!",
        "401": "Authentication Required!",
        "402": "Insufficient Credits!",
        "403": "Access Denied, Gunter!",
        "404": "Uh oh! You're about to zero out!",
        "405": "Invalid Method!",
        "406": "Format Not Supported!",
        "408": "Connection Timeout!",
        "409": "Data Collision!",
        "410": "Permanently Deleted!",
        "413": "File Too Large!",
        "429": "Rate Limit Exceeded!",
        "500": "OASIS System Failure!",
        "502": "Gateway Malfunction!",
        "503": "OASIS Overloaded!",
        "504": "Network Lag Detected!",
        "default": "System Error!"
    },
    "descriptions": {
        "400": "Your input data is corrupted, Gunter. The OASIS can't process this malformed request. Check your command syntax and try again.",
        "401": "Authentication failed. You need the right credentials to access this sector. Did you forget your haptic gloves?",
        "402": "This content requires payment. Even in the OASIS, nothing worth having comes easy. You'll need more credits, Gunter.",
        "403": "Access denied! This area is restricted. You don't have the artifact or clearance level needed to enter this zone.",
        "404": "Uh oh! You're about to zero out! The requested site could not be located. Perhaps you took the wrong path at the Halliday Journals.",
        "405": "Invalid method detected. This portal doesn't accept that type of request. Try a different approach, Gunter.",
        "406": "The OASIS system can't provide content in the format you requested. Adjust your client settings and reconnect.",
        "408": "Connection timeout. Your session took too long to respond and the OASIS server disconnected. Latency is everything, Gunter!",
        "409": "Conflict detected! There's a data collision in the system. Someone else might be modifying this resource simultaneously.",
        "410": "This content has been permanently deleted from the OASIS archives. Not even Halliday can bring it back now.",
        "413": "File size exceeds maximum upload limit. Even the OASIS has its limits. Try compressing your data, Gunter.",
        "429": "Too many requests! You're spamming the OASIS servers. Slow down or you'll get temporarily banned from this sector.",
        "500": "Internal Server Error! Something broke in the OASIS infrastructure. The admins are on it. Meanwhile, you might want to log out.",
        "502": "Bad Gateway. The OASIS relay servers are having trouble communicating. This connection route is unreliable right now.",
        "503": "Service Unavailable. The OASIS servers are currently overloaded or under maintenance. Try again later, Gunter.",
        "504": "Gateway Timeout. The OASIS network took too long to respond. The servers might be under heavy load or experiencing lag.",
        "default": "The requested site could not be located. Perhaps you took the wrong path at the Halliday Journals. Access denied."
    },
    "footers": {
        "400": "**HALLIDAY'S JOURNAL ENTRY #42**: \"Sometimes, the wrong input teaches you more than the right one.\"",
        "401": "**HALLIDAY'S JOURNAL ENTRY #89**: \"Access is earned, not given. That's rule one.\"",
        "402": "**HALLIDAY'S JOURNAL ENTRY #123**: \"Everything has a price, even in virtual worlds.\"",
        "403": "**HALLIDAY'S JOURNAL ENTRY #256**: \"Forbidden zones exist for a reason. Respect the barriers.\"",
        "404": "**HALLIDAY'S JOURNAL ENTRY #178**: \"Sometimes the most fun is in the chase, not the destination.\"",
        "405": "**HALLIDAY'S JOURNAL ENTRY #67**: \"Not every door opens the same way. Find the right key.\"",
        "406": "**HALLIDAY'S JOURNAL ENTRY #201**: \"Compatibility matters. Make sure you're speaking the same language.\"",
        "408": "**HALLIDAY'S JOURNAL ENTRY #88**: \"Patience is a virtue, but speed is a necessity.\"",
        "409": "**HALLIDAY'S JOURNAL ENTRY #144**: \"When two forces collide, only one can win.\"",
        "410": "**HALLIDAY'S JOURNAL ENTRY #404**: \"Some things, once lost, can never be recovered. Save often.\"",
        "413": "**HALLIDAY'S JOURNAL ENTRY #512**: \"Bigger isn't always better. Quality over quantity.\"",
        "429": "**HALLIDAY'S JOURNAL ENTRY #99**: \"Slow and steady wins the race. Don't spam the system.\"",
        "500": "**HALLIDAY'S JOURNAL ENTRY #500**: \"Even the best systems fail sometimes. That's when you reboot.\"",
        "502": "**HALLIDAY'S JOURNAL ENTRY #77**: \"Communication breakdowns happen. Find another route.\"",
        "503": "**HALLIDAY'S JOURNAL ENTRY #503**: \"Downtime is inevitable. Use it to plan your next move.\"",
        "504": "**HALLIDAY'S JOURNAL ENTRY #101**: \"Lag is the enemy of every Gunter. Wait for the connection.\"",
        "default": "**HALLIDAY'S JOURNAL ENTRY #178**: \"Sometimes the most fun is in the chase.\""
    }
}
