{
    "layout": "card-image",
    "name": "Big One Redd",
    "badge": "🚔 THIS IS THE BIG ONE! 🚔",
    "image": "resources/redd.jpg",
    "imageAlt": "Fred Sanford clutching chest",
    "fonts": "https://fonts.googleapis.com/css2?family=Courier+Prime:wght@700&family=Special+Elite&display=swap",
    "buttons": {
        "home": "Go Home",
        "back": "Go Back"
    },
    "footer": "You big dummy!",
    "titles": {
        "default": "The Case of the Missing Page"
    },
    "messages": {
        "400": "Bad Request",
        "401": "Unauthorized",
        "402": "Payment Required",
        "403": "Forbidden",
        "404": "Not Found",
        "405": "Method Not Allowed",
        "406": "Not Acceptable",
        "407": "Proxy Authentication Required",
        "408": "Request Timeout",
        "409": "Conflict",
        "410": "Gone",
        "411": "Length Required",
        "412": "Precondition Failed",
        "413": "Payload Too Large",
        "414": "URI Too Long",
        "415": "Unsupported Media Type",
        "416": "Range Not Satisfiable",
        "417": "Expectation Failed",
        "418": "I'm a teapot",
        "421": "Misdirected Request",
        "422": "Unprocessable Entity",
        "423": "Locked",
        "424": "Failed Dependency",
        "425": "Too Early",
        "426": "Upgrade Required",
        "428": "Precondition Required",
        "429": "Too Many Requests",
        "431": "Request Header Fields Too Large",
        "451": "Unavailable For Legal Reasons",
        "500": "Internal Server Error",
        "501": "Not Implemented",
        "502": "Bad Gateway",
        "503": "Service Unavailable",
        "504": "Gateway Timeout",
        "505": "HTTP Version Not Supported",
        "506": "Variant Also Negotiates",
        "507": "Insufficient Storage",
        "508": "Loop Detected",
        "510": "Not Extended",
        "511": "Network Authentication Required",
        "default": "Unknown Error"
    },
    "descriptions": {
        "400": "Bad request?! You big DUMMY! You gotta coordinate your typing! In the war, we had to coordinate our attacks or we'd all be dead!",
        "401": "Unauthorized?! Let me tell you something - back in the war, you show up without authorization, they put you in the brig! You understand me, dummy?!",
        "402": "They want PAYMENT?! Elizabeth, I'm coming! My chest! In all my years running this junkyard, I never heard such a thing!",
        "403": "FORBIDDEN?! This page is like Aunt Esther's face - off limits and nobody wants to see it anyway! Oh, my heart!",
        "404": "Not found? You big dummy! This is like when Lamont can't find my good whiskey that I hid in the radiator - you ain't looking hard enough!",
        "405": "Wrong method?! In the war, we used the RIGHT method or people got hurt! You gotta COORDINATE these things!",
        "406": "Not acceptable?! Well I got news for you - Aunt Esther ain't acceptable either but she still shows up! Elizabeth, I'm coming!",
        "408": "Timeout?! I'll give YOU a timeout, you big dummy! My heart can't take all this waiting - this is the BIG ONE!",
        "409": "Conflict? CONFLICT?! Let me tell you about conflict - in the war, we had REAL conflict! Bombs, bullets, Aunt Esther visiting the base!",
        "410": "Gone permanently?! Just like my good looks, my hair, and my first truck! Everything good in my life is GONE! I'm coming, Elizabeth!",
        "413": "Too large?! That's what the doctor said about my heart after Aunt Esther showed up! You gotta coordinate the size, dummy!",
        "429": "Too many requests?! You're worse than Grady asking to borrow money! STOP ASKING! My ticker can't handle this!",
        "500": "Internal error?! My INSIDES got an error too - it's called a HEART ATTACK! This is the big one, Elizabeth!",
        "502": "Bad gateway?! In the war, a bad gateway meant you walked into the WRONG CAMP! Coordinate your routes, you big dummy!",
        "503": "Service unavailable?! That's like me after Aunt Esther leaves - I need time to RECOVER! My heart, Elizabeth!",
        "504": "Gateway timeout?! Elizabeth, you hear this?! Even the MACHINES are having heart problems now! I'm coming to join you, honey!",
        "default": "This is the big one, Elizabeth! I'm coming to join you, honey!"
    }
}
